# GetWSImage

## Description
Returns a handle to the on-drawing object (image) of the referenced worksheet.

```pascal
FUNCTION GetWSImage(worksheet : HANDLE): HANDLE;
```

```python
def vs.GetWSImage(worksheet):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|Handle to worksheet.|

## Version
Availability: from VectorWorks9.0

## Category
* Worksheets